{
  "pub": [
      {
        "authors": "Brendan Lyden, Ruairi O'Reilly",
        "title": "Sleep Apnea Classification in an Activity Tracker Environment",
        "venue": "2021 IEEE EMBS International Conference on Biomedical and Health Informatics (BHI)",
        "year": "2021",
        "pdf": "",
        "type":"poster",
        "research_gate": "https://www.researchgate.net/publication/353572505_Sleep_Apnea_Classification_in_an_Activity_Tracker_Environment",
        "google_scholar": "",
        "bib": "",
        "abstract": "Sleep apnea is one of the most common sleep disorders. It can have a variety of detrimental effects ranging from trouble breathing to increased risk of heart failure. Sleep apnea often goes undiagnosed due to the practicalities and cost of getting tested. To be diagnosed with sleep apnea, a patient must undertake a polysomnography (PSG) or sleep study where multiple physiological signals are recorded in a specialised sleep laboratory. Diagnosing sleep apnea using data gathered in a distributed manner could help to remove barriers to diagnosis. Prior work has largely focused on creating machine learning models trained on a subset of the physiological signals that are recorded in a medical setting. Activity trackers are becoming more advanced with the current generation being capable of deriving blood oxygen saturation (SpO2). SpO2 has been shown to be an important indicator for sleep apnea. Activity tracker data acquisition faces challenges, such as the sampling rate of data and noise associated with the signal. This work compares the performance of ML models in a simulated activity tracker environment. The results show that a Support Vector Machine (SVM) classifier trained with features extracted from a Convolutional Neural Network (CNN) is capable of classifying sleep apnea with a high degree of accuracy."
      },
      {
        "authors": "David Walshe, Ruairi O'Reilly",
        "title": "Methods for Creating Reproducible Machine Learning Pipelines for Skin Lesion Classification",
        "venue": "2021 IEEE EMBS International Conference on Biomedical and Health Informatics (BHI)",
        "year": "2021",
        "pdf": "",
        "type":"poster",
        "research_gate": "https://www.researchgate.net/publication/353574080_Methods_for_Creating_Reproducible_Machine_Learning_Pipelines_for_Skin_Lesion_Classification",
        "google_scholar": "",
        "bib": "",
        "abstract": "In the domain of skin lesion classification using computer-aided diagnosis (CAD), machine learning (ML) approaches found in the literature are reported to be highly effective. However, state-of-the-art findings can prove challenging to reimplement due to inconsistencies and ambiguities in recorded methodologies. These ambiguities reduce the velocity at which future research advancements can be achieved. This abstract proposes an ML configuration capture method that obtains a complete and faithful descriptor of an ML workflow. This descriptor is serialised into a sharable file format, enabling subsequent research to reimplement a cited model to a high degree of accuracy. Following this configuration capture, reproducing input data sources is an essential step in the faithful reimplementation of baseline models. This abstract also delivers a centralised data sourcing tool for the automated acquisition of highly cited skin lesion datasets from various sources. The work contributes a standardised approach in creating reproducible and sharable ML-based workflows, enabling accelerated machine learning research in the domain of skin lesion classification."
      },
        {
          "authors": "Dair, Zachary and Donovan, Ryan and O’Reilly, Ruairi",
          "title": "Classification of Emotive Expression Using Verbal and Non Verbal Components of Speech",
          "venue": "32nd Irish Signals and Systems Conference (ISSC)",
          "year": "2021",
          "pdf": "N/A",
          "type":"conference",
          "research_gate": "https://www.researchgate.net/publication/352926496_Classification_of_Emotive_Expression_Using_Verbal_and_Non_Verbal_Components_of_Speech",
          "google_scholar": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=86x5oQgAAAAJ&sortby=pubdate&citation_for_view=86x5oQgAAAAJ:L8Ckcad2t8MC",
          "bib": "@INPROCEEDINGS{9467869, author={Dair, Zachary and Donovan, Ryan and O’Reilly, Ruairi}, booktitle={2021 32nd Irish Signals and Systems Conference (ISSC)}, title={Classification of Emotive Expression Using Verbal and Non Verbal Components of Speech}, year={2021}, volume={}, number={}, pages={1-8}, doi={10.1109/ISSC52156.2021.9467869}}",
          "abstract": "This paper presents an approach for enabling emotive expression classification through speech analysis combining affective prosody (Mel-frequency Cepstral Coefficient, Zero Crossing Rate, Chroma Energy Normalised) and semantic analysis (Bag-of-words model). Two machine learning (ML) classifiers, a convolutional neural network (CNN) and logistic regression (LR) model, are combined to form an ensemble based approach for the classification of emotive expressions from multi-modal data (audio, text). The approach builds upon existing work in emotion classification, sentiment analysis, and natural language processing (NLP) techniques. The paper contributes a workflow for the comparative analysis of the efficacy in classifying emotion from multi-modal data. The results demonstrate mixed accuracy across varied data sources, indicating the limitations and considerations of a generalised approach.  The approach utilised has direct benefits for Affective computing research as it enables (a) insight into the strengths and limitations of such models in correctly classifying emotion in relation to population differences (e.g. gender) and provides (b) a baseline for emotion classification in speech across the six canonical basic emotions (Anger, Fear, Disgust, Joy, Sadness, Surprise)."
      },
      {
        "authors": "Pawar, Urja and Culbert, Christopher T and O'Reilly, Ruairi",
        "title": "Evaluating Hierarchical Medical Workflows using Feature Importance",
        "venue": "IEEE 34th International Symposium on Computer-Based Medical Systems (CBMS)",
        "year": "2021",
        "pdf": "N/A",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/353197756_Evaluating_Hierarchical_Medical_Workflows_using_Feature_Importance",
        "google_scholar": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=86x5oQgAAAAJ&sortby=pubdate&citation_for_view=86x5oQgAAAAJ:ZeXyd9-uunAC",
        "bib": "@INPROCEEDINGS{9474678, author={Pawar, Urja and Culbert, Christopher T and O'Reilly, Ruairi}, booktitle={2021 IEEE 34th International Symposium on Computer-Based Medical Systems (CBMS)}, title={Evaluating Hierarchical Medical Workflows using Feature Importance}, year={2021}, volume={}, number={}, pages={265-270}, doi={10.1109/CBMS52027.2021.00075}}",
        "abstract": "The applicability and utility of Artificial Intelligence (AI) based solutions has been demonstrated widely in the healthcare domain via the automated analysis of medical information. However, the adoption rate of AI-based healthcare systems is inhibited due to their complicated nature. Also, the hierarchical nature of the medical settings adds a layer of complexity in understanding how a Machine Learning (ML) model functions when subjected to varying workflows. Variation in models' performance, and individual features' contribution, needs to be effectively quantified such that medical practitioners can understand the models, and validate their operation if widespread adoption is to be enabled. In this paper, a hierarchical medical workflow for understanding the operation of ML in a healthcare-based setting is proposed. Its utility is demonstrated in the context of heart disease classification. Explainable Artificial Intelligence (XAI) is incorporated in the form of Feature Importance (FI) scores and correlated with an ML model's performance metrics (Accuracy, F1-score). This provides a multi-stakeholder perspective aligned with the hierarchy as experienced in a real-world medical setting.  The paper contributes a methodology for accommodating an enhanced understanding of diverse hierarchical healthcare settings that would benefit from the adoption of AI-based systems.  "
      },
      {
        "authors": "Ryan Donovan, Aoife Johnson, Aine deRoiste, Ruairi O'Reilly",
        "title": "A Multimodal Workflow for Modeling Personality and Emotions to Enable User Profiling and Personalisation",
        "venue": "5th International Conference on Human Computer Interaction Theory and Applications (HUCAPP 2021)",
        "year": "2021",
        "pdf": "",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/349179575_A_Multimodal_Workflow_for_Modeling_Personality_And_Emotions_to_Enable_User_Profiling_and_Personalisation",
        "google_scholar": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=86x5oQgAAAAJ&sortby=pubdate&citation_for_view=86x5oQgAAAAJ:M3ejUd6NZC8C",
        "bib": "@inproceedings{donovan2021multimodal, title={A Multimodal Workflow for Modeling Personality and Emotions to Enable User Profiling and Personalisation.},  author={Donovan, Ryan and Johnson, Aoife},  year={2021}}",
        "abstract": "The Personality Emotion Mapping (PEM) model is a workflow for generating quantifiable and bi-directional mappings between 15 personality traits and the basic emotions. PEM utilises Affective computing methodology to map this relationship across the modalities of self-report, facial expressions, semantic analysis, and affective prosody.  The workflow is an end-to-end solution integrating data collection, feature extraction, data analysis, and result generation. PEM results in a real-time model that provides a high-resolution correlated mapping between personality traits and the basic emotions. The robustness of PEM's model is supported by the workflow's ability to conduct meta-analytical and multimodal analysis; each state-to-trait mapping is dynamically updated in terms of its magnitude, direction, and statistical significance as data is processed. PEM provides a methodology that can contribute to long-standing research questions in the fields of Psychology and Affective computing. These research questions include (i) quantifying the emotive nature of personality, (ii) minimising the effects of context variance in basic emotions research, and (iii) investigating the role of emotion sequencing effects in relation to individual differences. PEM's methodology enables direct applications in any domain that requires the provision of individualised and personalised services (e.g. advertising, clinical care, research)."
      },
      {
        "authors": "Ryan Donovan, Aoife Johnson, Ruairi O’Reilly",
        "title": "Differentiation in Personality Emotion Mappings From Self Reported Emotion and Automatically Classified Emotion",
        "venue": "The 28th Irish Conference on Artificial Intelligence and Cognitive Science (AICS2020)",
        "year": "2020",
        "pdf": "https://scholar.google.com/scholar?oi=bibs&cluster=6854598996442605389&btnI=1&hl=en",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/346717964_Differentiation_in_Personality_Emotion_Mappings_From_Self_Reported_Emotion_and_Automatically_Classified_Emotion",
        "google_scholar": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=86x5oQgAAAAJ&sortby=pubdate&citation_for_view=86x5oQgAAAAJ:4TOpqqG69KYC",
        "bib": "@inproceedings{donovan2020differentiation,  title={Differentiation in Personality Emotion Mappings From Self Reported Emotion and Automatically Classified Emotion.}, author={Donovan, Ryan and Johnson, Aoife}}",
        "abstract": "How does the relationship between personality traits and the basic emotions vary across the modalities of self-report and facial expression analysis? This article presents the results of an exploratory study that quantifies consistencies and differences in personality-emotion mappings across these two modalities. Twenty-four participants answered a personality questionnaire before watching twelve emotionally provocative videos. Participant's self-reported their emotional reactions per video, while their facial expressions were being recorded for automated emotional analysis. The results indicated that overall there was greater consistency than differences in personality-emotion mappings across the two modalities. The robustness of this relationship enables direct applications of emotional-state-to-personality-trait in academic and industrial domains."
      },
      {
        "authors": "Urja Pawar, Donna O’Shea, Susan Rea, Ruairi O’Reilly",
        "title": "Incorporating Explainable Artificial Intelligence (XAI) to aid the Understanding of Machine Learning in the Healthcare Domain",
        "venue": "The 28th Irish Conference on Artificial Intelligence and Cognitive Science",
        "year": "2020",
        "pdf": "https://scholar.google.com/scholar?oi=bibs&cluster=17994771636564724444&btnI=1&hl=en",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/346717871_Incorporating_Explainable_Artificial_Intelligence_XAI_to_aid_the_Understanding_of_Machine_Learning_in_the_Healthcare_Domain",
        "google_scholar": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=86x5oQgAAAAJ&sortby=pubdate&citation_for_view=86x5oQgAAAAJ:3fE2CSJIrl8C",
        "bib": "@inproceedings{pawar2020incorporating, title={Incorporating Explainable Artificial Intelligence (XAI) to aid the Understanding of Machine Learning in the Healthcare Domain.}, author={Pawar, Urja and Rea, Susan}}",
        "abstract": "In the healthcare domain, Artificial Intelligence (AI) based systems are being increasingly adopted with applications ranging from surgical robots to automated medical diagnostics. While a Machine Learning (ML) engineer might be interested in the parameters related to the performance and accuracy of these AI-based systems, it is postulated that a medical practitioner would be more concerned with the applicability, and utility of these systems in the medical setting. However, medical practitioners are unlikely to have the prerequisite skills to enable reasonable interpretation of an AI-based system. This is a concern for two reasons. Firstly, it inhibits the adoption of systems capable of automating routine analysis work and prevents the associated productivity gains. Secondly, and perhaps more importantly, it reduces the scope of expertise available to assist in the validation, iteration, and improvement of AI-based systems in providing healthcare solutions. Explainable Artificial Intelligence (XAI) is a domain focused on techniques and approaches that facilitate the understanding and interpretation of the operation of ML models. Research interest in the domain of XAI is becoming more widespread due to the increasing adoption of AI-based solutions and the associated regulatory requirements . Providing an understanding of ML models is typically approached from a Computer Science (CS) perspective with a limited research emphasis being placed on supporting alternate domains.In this paper, a simple, yet powerful solution for increasing the explainability of AI-based solutions to individuals from non-CS domains (such as medical practitioners), is presented. The proposed solution enables the explainability of ML models and the underlying workflows to be readily integrated into a standard ML workflow.Central to this solution are feature importance techniques that measure the impact of individual features on the outcomes of AI-based systems. It is envisaged that feature importance can enable a high-level understanding of a ML model and the workflow used to train the model. This could aid medical practitioners in comprehending AI-based systems and enhance their understanding of ML models' applicability and utility."
      },
      {
          "authors": "Chand Sheikh, Farshad Ghassemi Toosi, Ruairi O'Reilly",
          "title": "An Ensemble-based Approach to the Detection of COVID-19 Induced Pneumonia using X-Ray Imagery",
          "venue": "Irish Machine Vision & Image Processing Conference",
          "year": "2020",
          "pdf": "N/A",
          "type":"conference",
          "research_gate": "N/A",
          "google_scholar": "N/A",
          "bib": "",
        "abstract": "The rapid emergence and spread of COVID-19 resulted in a surge in demand for laboratory-based testing globally. Currently, the gold standard diagnostic approach is large-scale molecular testing of biological samples which detect the SARS-CoV-2 virus RNA.  Infrastructure limitations and supply shortages are limiting testing capacity with a growing demand for COVID-19 diagnostics across the EU. X-ray imagery is essential in establishing the severity of a multitude of diseases and monitoring responses of patients in the hospital setting. X-ray imagery should not be used to screen for or as a first-line test to detect COVID-19. However, X-ray presents an ideal opportunity to integrate additional screening measures into a pre-existing workflow. This paper investigates the utilisation of machine learning in automating the detection of COVID-19 induced pneumonia from X-Ray imagery. The approach will assist radiologists in the monitoring and differentiation of pneumonia caused by COVID-19 from other viral causes. A classification for the presence, or absence, of pneumonia caused by COVID-19 and other viral causes is derived. The paper contributes an initial investigation into an ensemble-learning based approach using transfer learning models VGG16, Inception and ResNet. The results of this work indicate an improved performance using ensemble-based learning as compared to an individual transfer learning model."
        },
        {
          "authors": "Liam Murphy, Ruairi O'Reilly",
          "title": "A Comparative Analysis of a State-of-the-Art CNN versus a Bespoke Capsule Network for Cell Image Classification",
          "venue": "Irish Machine Vision & Image Processing Conference",
          "year": "2020",
          "pdf": "N/A",
          "type":"conference",
          "research_gate": "N/A",
          "google_scholar": "N/A",
          "bib": "",
          "abstract": "Despite state of the art performance on object recognition and image classification problems, CNNs are considered to have two significant weaknesses. Firstly, their inability to cater for changes in object orientation, position or lighting. Secondly, their inability to deal with part-whole relationships between objects. Capsule Networks are an enhancement to CNNs to more closely model the viewpoint invariance capability of human vision. The application of Capsule Networks to well known datasets, such as MNIST and NORB, has achieved state of the art performance, while application to other datasets has had mixed results. The application of Capsule Networks to domains such as medical based imaging problems is of significant interest as they have been shown to train accurately on some datasets with limited training data. The contribution of this research is to compare the performance of a Capsule Network to a highly accurate CNN specifically developed for classification of malaria infected and uninfected cell images. It looks at how the accuracy of each model is affected by the volume of available training data, and at how robust each model is to classifying test images subjected to transformation such as rotation, shear and lighting change."
        },
        {
          "authors": "Ryan Donovan, Aoife Johnson, Aine De Roiste, Ruairi O'Reilly",
          "title": "Quantifying the Links between the Basic Emotions and Personality Sub-Traits",
          "venue": "Workshop on Affective Computing and Emotion Recognition",
          "year": "2020",
          "pdf": "https://drive.google.com/file/d/1WcwNoxUlffupa1cIm5yIZMpH-LpEYUlY/view?usp=sharing",
          "type":"workshop",
          "research_gate": "",
          "google_scholar": "",
          "bib": "https://www.researchgate.net/publication/343691819_Quantifying_the_Links_between_Personality_Sub-Traits_and_the_Basic_Emotions",
          "abstract": "This article describes an exploratory study that aimed to analyse the relationship between personality traits and emotions. In particular, it investigates to what extent the sub-traits of the Five Factor Model has an empirically quantifiable correlation with the Basic Emotions (Anger, Anxiety, Disgust, Fear, Joy, Sadness, Surprise). If links between these personality traits and the basic emotions can be found, then this would enable an emotional-state-to-personality-trait mapping. In this study, 38 participants answered a Big Five Aspects Scale (BFAS) questionnaire and then watched 12 emotionally provocative film clips along with answering 12 short emotional Likert-scales on their emotional experiences during each film clip. The results showed that (i) four of the seven Basic Emotions outright significantly correlated, while two emotions (Fear and Disgust) approached statistical significance,  with at least one of the personality traits and (ii) significant correlations between personality traits and basic emotions could only be identified at the sub-trait level, demonstrating the value in adopting a higher-resolution personality model. The results supports the long-term goal of this research, which is the enabling of state-to-trait inferences. A method for analysing and visualising such a mapping, that differentiates mappings based on the direction and magnitude of the effect size was also developed. The study contributes a blueprint towards utilising Affective Computing methodology to automatically map these phenomena."
        },
      {
        "authors": "Ryan Donovan, Jamie Cotter, Ruairi O'Reilly",
        "title": "Improving Academic Performance Amongst First Years College Students through a Goal-Setting Program",
        "venue": "The 31st Irish Signals and Systems Conference",
        "year": "2020",
        "pdf": "https://drive.google.com/file/d/1-qBDFwzNhkERdiE3yT29FNYodasxr0E6/view?usp=sharing",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/342600573_Improving_Academic_Performance_Amongst_First_Years_Computer_Science_Students_Through_Goal-Setting",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1s4laW9flnxajVltBxJ6SETg97pqFlaUQ/view?usp=sharing",
        "abstract": "Academic performance across Computer Science (CS) courses in the Republic of Ireland is underwhelming. CS undergraduates are statistically the most likely cohort in the country not to progress past year one of their studies. Insufficient motivation to pursue CS studies has been demonstrated to be a significant cause of poor CS academic performance. Goal-setting programs are an efficient, cost-effective, and student empowering way to boost motivation. Goal-setting is the formulation of a set of activities intended to motivate an individual to the desired goal state. This paper provides an experimental design for assessing the effectiveness of a written goal-setting program on academic performance concerning individual differences. Participants are randomly assigned either to the written goal-setting program or an active control task via an online platform. The goal-setting program requires participants to articulate both a desired future life and a feared future life. The program also requires participants to: identify goals and sub-goals across several domains (e.g. family, health, study); the benefits that achieving their goals would have for themselves for their connected group; the daily habits they could develop to make their ideal future more likely to occur. This study also investigates how personality (via a high-resolution personality model) and cognitive differences influence goal-setting effectiveness. Differences in both Semester 1 performance and the number of students who progress to Semester 2 are assessed between experimental groups. An ANCOVA analysis will assess whether the effectiveness of an experimental task varied based on individual differences in personality and/or cognitive ability."
      },
      {
        "authors": "Urja Pawar, Susan Rea, Donna O'Shea, Ruairi O'Reilly",
        "title": "Explainable AI in Smart Healthcare",
        "venue": "Cyber Science 2020",
        "year": "2020",
        "pdf": "https://drive.google.com/file/d/1eT_RWs5d6bKvJYV-ip2DtkWac05zLKSq/view?usp=sharing",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/342600571_Explainable_AI_in_Healthcare",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/11iFLwEctO4NxQ2D_dfBCMkQRqbVRf7nU/view?usp=sharing",
        "abstract": "Artificial Intelligence (AI) is an enabling technology that when integrated into healthcare applications and smart wearable devices such as Fitbits etc. can predict the occurrence of health conditions in users by capturing and analysing their health data. The integration of AI and smart wearable devices has a range of potential applications in the area of smart healthcare but there is a challenge in the black box operation of decisions made by AI models which have resulted in a lack of accountability and trust in the decisions made. Explainable AI (XAI) is a domain in which techniques are developed to explain predictions made by AI systems. In this paper, XAI is discussed as a technique that can used in the analysis and diagnosis of health data by AI-based systems and a proposed approach presented with the aim of achieving accountability. transparency, result tracing, and model improvement in the domain of healthcare."
      },
      {
        "authors": "Jack Hickey, Ruairi O'Reilly",
        "title": "Enabling Multi-Party Consensual Data Exchange Through Blockchain",
        "venue": "The 27th Irish Conference on Artificial Intelligence and Cognitive Science",
        "year": "2019",
        "pdf": "https://drive.google.com/file/d/1qvBXKFw4odG6cKAzwy1pgTeSEzVM0NtL/view?usp=sharing",
        "type":"poster",
        "research_gate": "https://www.researchgate.net/publication/337790840_Enabling_Multi-Party_Consensual_Data_Exchange_Through_Blockchain",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1TAguaYZnenL_kcTFehK7lFqCMSmSpve5/view?usp=sharing",
        "abstract": "The quantity and quality of data available to an organisation plays an increasingly important role in its operation. This data can relate to a variety of subjects, from the internal logistics to consumer sentiment towards a product in a specific market. This data provides increasingly optimal behaviour derived from its analysis, e.g. improved decision making. As more advanced, application-specific, machine learning models are developed, the organisation with the largest share of data will gain an advantage over its competitors. It is postulated that smaller entities with minority shares in data within a domain possess only a fragmented view of a market. This fragmented view puts the smaller entity at a disadvantage and enables larger entities to reap unfair, competitive advantages. This unequal dynamic should be rectified. To that end, in this work, a model is proposed that enables the consensual sharing of data between multiple parties using blockchain."
      },
      {
        "authors": "Sean Quinlan, Haithem Afli and Ruairi O'Reilly",
        "title": "A Comparative Analysis of Classification Techniques for Cervical Cancer Utilising At Risk Factors and Screening Test Results",
        "venue": "The 27th Irish Conference on Artificial Intelligence and Cognitive Science",
        "year": "2019",
        "pdf": "https://drive.google.com/file/d/1JIty3MLP50I0skd8ZeaXcnO46mrcGPmK/view?usp=sharing",
        "type":"poster",
        "research_gate": "https://www.researchgate.net/publication/337790766_A_Comparative_Analysis_of_Classification_Techniques_for_Cervical_Cancer_Utilising_At_Risk_Factors_and_Screening_Test_Results",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1iZlGO1D5EJD136RNy_l6CLPSWRHooWVf/view?usp=sharing",
        "abstract": "Cervical cancer is a severe concern for women's health. Every year in the Republic of Ireland, approximately 300 women are diagnosed with cervical cancer, 30% for whom the diagnosis will prove fatal. It is the second most common cause of death due to cancer in women aged 25 to 39 years. Recently there has been a series of controversies concerning the mishandling of results from cervical screening tests, delays in processing said tests and the recalling of individuals to retake tests. The serious nature of the prognosis highlights the importance and need for the timely processing and analysis of data related to screenings. This work presents a comparative analysis of several classification techniques used for the automated analysis of known risk factors and screening tests with the aim of predicting cervical cancer outcomes via a Biopsy result. These techniques encompass methods such as tree-based, cluster-based, liner and ensemble techniques, and where applicable use parameter tuning to determine optimal model parameters. The dataset utilised for training and validation consists of 858 observations and 36 variables, including the binary target variable \"Biopsy\". The data itself is heavily imbalanced with 803 negative and 55 positive observations with approximately 11.73% of the data points missing. These issues are addressed during pre-processing by methods such as mean or median imputation, as well as over-sampling, under-sampling and combination techniques which led to the creation of 6 augmented datasets of varying size, consisting of 34 variables including the response Biopsy. The results show that a SMOTE-Tomek combination resampling method in conjunction with a tuned Random Forest model produced an accuracy score of 99.69% with a recall and precision value of 0.99% for both positive and negative responses."
      },
      {
        "authors": "Gaurav Kumar, Urja Pawar and Ruairi O'Reilly",
        "title": "Arrhythmia Detection in ECG Signals Using a Multilayer Perceptron Network",
        "venue": "The 27th Irish Conference on Artificial Intelligence and Cognitive Science",
        "year": "2019",
        "pdf": "https://drive.google.com/file/d/1q0-vrYv3noUSdPQKDRM0vuzuRmqxPD_w/view?usp=sharing",
        "type":"poster",
        "research_gate": "https://www.researchgate.net/publication/337790877_Arrhythmia_Detection_in_ECG_Signals_Using_a_Multilayer_Perceptron_Network",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1p6zBc7_I24KBPo2d5A8iCeFYxsWHhViX/view?usp=sharing",
        "abstract": "Electrocardiography (ECG) is a form of physiological data used to record the electrical activity of the heart. Numerous researchers have proposed and developed methods to extract features from the ECG signal (for example, R-R segment, P-R segment). These features can be used to analyse and classify various forms of heart arrhythmia. In this work, a method for ECG classification that employs a generalised signal pre-processing technique and uses a Multi-Layer Perceptron network to classify arrhythmia per the AAMI EC57 standard accurately is presented. The method is trained and evaluated using PhysioNet's MIT-BIH dataset, and an average accuracy of 98.72% is achieved. The proposed methodology is comparable to state-of-the-art CNN models, both in terms of accuracy and efficiency."
      },
      {
        "authors": "P. Nisha, Urja Pawar and Ruairi O'Reilly",
        "title": "Interpretable Machine Learning Models for Assisting Clinicians in the Analysis of Physiological Data",
        "venue": "The 27th Irish Conference on Artificial Intelligence and Cognitive Science",
        "year": "2019",
        "pdf": "https://drive.google.com/file/d/1lmOf6RL8-kE-DaGfTq3mblrezp29jvVN/view?usp=sharing",
        "type":"poster",
        "research_gate": "https://www.researchgate.net/publication/337790628_Interpretable_Machine_Learning_Models_for_Assisting_Clinicians_in_the_Analysis_of_Physiological_Data",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1pQrgdhqBqmg8l8Fu4RtjLLakLhUv7hVm/view?usp=sharing",
        "abstract": "The analysis of physiological data plays a significant role in medical diagnostics. While state-of-the-art machine learning models demonstrate high levels of performance in classifying physiological data clinicians are slow to adopt them. A contributing factor to the slow rate of adoption is the \"black-box\" nature of the underlying model whereby the clinician is presented with a prediction result, but the rationale for that result omitted or not presented in an interpretable manner. This gives rise to the need for interpretable machine learning models such that clinicians can verify, and rationalise, the predictions made by a model. If a clinician understands why a model makes a prediction, they will be more inclined to accept a models assistance in analysing physiological data. This paper discusses some of the latest findings in interpretable machine learning. Thereafter, based on these findings, three models are selected and implemented to analyse ECG data that are both accurate and exhibit a high level of interpretability."
      },
      {
        "authors": "David Foley, Ruairi O'Reilly",
        "title": "An Evaluation of Convolutional Neural Network Models for Object Detection in Images on Low-End Devices",
        "venue": "The 26th Irish Conference on Artificial Intelligence and Cognitive Science",
        "year": "2018",
        "pdf": "https://drive.google.com/file/d/17q_rHs2wGpN83IyN4krDlAY9t9vjUXco/view?usp=sharing",
        "type":"poster",
        "research_gate": "https://www.researchgate.net/publication/332370683_An_Evaluation_of_Convolutional_Neural_Network_Models_for_Object_Detection_in_Images_on_Low-End_Devices",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/18DjlMGQY66f6GnCBiMg4NrOjfWQKZol6/view?usp=sharing",
        "abstract": "This research paper investigates the running of object detection algorithms on low-end devices to detect individuals in images while leveraging cloud-based services to provide facial verification of the individuals detected. The performance of three computer vision object detection algorithms that utilize Convolutional Neural Networks (CNN) are compared: SSD MobileNet, Inception v2 and Tiny YOLO along with three cloud-based facial verification services: Kairos, Amazon Web Service Rekognition (AWS) and Microsoft Azure Vision API. The results contribute to the limitations of running CNN based algorithms to solve vision tasks on low-end devices and highlights the limitations of using such devices and models in an application domain such as a home-security solution."
      },
      {
        "authors": "Orla O'Brien, R. D. O'Reilly",
        "title": "Beats-Per-Minute (BPM): A Microservice-based Platform for the Monitoring of Health-Related Data via Activity Trackers",
        "venue": "The 20th IEEE International Conference on E-health Networking, Application & Services",
        "year": "2018",
        "pdf": "https://drive.google.com/file/d/1BzVrGIgLMIGc3iPqtdg8kKDHtTly0z3b/view?usp=sharing",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/328903374_Beats-Per-Minute_BPM_A_Microservice-based_Platform_for_the_Monitoring_of_Health_Related_Data_via_Activity_Trackers",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1UAQic1MVwPWIWleQjrd617JyPrzL1OhD/view?usp=sharing",
        "abstract": "Beats-Per-Minute (BPM) is a microservice-based platform that provides a monitoring solution for the continuous acquisition, analysis and visualisation of health related data. BPM combines Commercial Off-The-Self (COTS) Activity Trackers and a scalable cloud-based infrastructure. This paper demonstrates the efficacy, reliability and integrity of BPM when utilised as a monitoring solution for health conditions, such as Cardiovascular Disease. The results are indicative of the suitability of a microservice-based architecture for such a platform."
      },
      {
        "authors": "Ruairi O'Reilly",
        "title": "A Distributed Architecture for the Monitoring and Analysis of Time Series Data",
        "venue": "University College Cork",
        "year": "2015",
        "pdf": "https://drive.google.com/file/d/1Ant3f3wmFcL49KPOfsAU9OCGZhOq6-F0/view?usp=sharing",
        "type":"thesis",
        "research_gate": "https://www.researchgate.net/publication/325416430_A_Distributed_Architecture_for_the_Monitoring_and_Analysis_of_Time_Series_Data",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1skZnZ6fNTpLIlYbJ4Px_airxS6y7vahN/view?usp=sharing",
        "abstract": "Systems for the monitoring and analysis of data, e.g. stock markets, smart grids and sensor networks, can be made up of massive numbers of individual components. These components can be geographically distributed yet may interact with one another via continuous data streams, which in turn may affect the state of the sender or receiver. This introduces a dynamic causality, which further complicates the overall system by introducing a temporal constraint that is difficult to accommodate. Practical approaches to realising the system described above have led to a multiplicity of analysis techniques, each of which concentrates on specific characteristics of the system being analysed and treats these characteristics as the dominant component affecting the results being sought. The multiplicity of analysis techniques introduces another layer of heterogeneity, that is heterogeneity of approach, partitioning the field to the extent that results from one domain are difficult to exploit in another. The question is asked can a generic solution for the monitoring and analysis of data that: accommodates temporal constraints; bridges the gap between expert knowledge and raw data; and enables data to be effectively interpreted and exploited in a transparent manner, be identified? The approach proposed in this dissertation acquires, analyses and processes data in a manner that is free of the constraints of any particular analysis technique, while at the same time facilitating these techniques where appropriate. Constraints are applied by defining a workflow based on the production, interpretation and consumption of data. This supports the application of different analysis techniques on the same raw data without the danger of incorporating hidden bias that may exist. To illustrate and to realise this approach a software platform has been created that allows for the transparent analysis of data, combining analysis techniques with a maintainable record of provenance so that independent third party analysis can be applied to verify any derived conclusions. In order to demonstrate these concepts, a complex real world example involving the near real-time capturing and analysis of neurophysiological data from a neonatal intensive care unit (NICU) was chosen. A system was engineered to gather raw data, analyse that data using different analysis techniques, uncover information, incorporate that information into the system and curate the evolution of the discovered knowledge. The application domain was chosen for three reasons: firstly because it is complex and no comprehensive solution exists; secondly, it requires tight interaction with domain experts, thus requiring the handling of subjective knowledge and inference; and thirdly, given the dearth of neurophysiologists, there is a real world need to provide a solution for this domain."
      },
      {
        "authors": "Ruairi O'Reilly, D Power, PD Healy, JP Morrison and GB Boylan",
        "title": "ScrutiniseIT: A Search-Based Approach to EEG Seizure Detection",
        "venue": "The Fifth International Conference on eHealth, Telemedicine, and Social Medicine",
        "year": "2013",
        "pdf": "https://drive.google.com/file/d/1OtklV648rFtBUbYLVfIEnMlwt6qf_Exq/view?usp=sharing",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/236694822_ScrutiniseIT_A_Search-Based_Approach_to_EEG_Seizure_Detection",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1H9rCd2OsGba_uLKQZzHwHzswEO6IOoGm/view?usp=sharing",
        "abstract": "Seizures are both the most common neurological emergency afflicting neonates and the most difficult to detect clinically. Currently, the monitoring of a multi-channel electroencephalogram (EEG) is the gold standard for seizure detection. The accurate analysis of this physiological data requires a neurophysiologist with expertise in neonatal EEG. The provisioning of this expertise on a continuous basis can be challenging for medical facilities. In this paper, we describe a cloud-based platform capable of supporting clinicians through the creation of expert knowledge repositories. While the platform is considered general purpose, in this work it is applied specifically to neonatal EEG."
      },
      {
        "authors": "Ruairi O'Reilly, JP Morrison and Carolyn McGregor",
        "title": "A System for the Transmission, Processing and Visualisation of EEG to Support Irish Neonatal Intensive Care Units",
        "venue": "The 25th Canadian Conference on Electrical and Computer Engineering",
        "year": "2012",
        "pdf":"https://drive.google.com/file/d/1gocqkjk3UtzmefE9fJ-MoO8kwf3BWL4D/view?usp=sharing",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/342600559_A_system_for_the_transmission_processing_and_visualisation_of_EEG_to_support_Irish_Neonatal_Intensive_Care_Units",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/16kmD4Iu1L05Q9QOBJTkSdX1PKV_pZa9q/view?usp=sharing",
        "abstract": "A system, constructed as a \"proof of concept\", for providing an Irish tele-neurophysiology service is presented. It is based on a distributed architecture and capable of handling synchronous data streams from multiple Irish Neonatal Intensive Care Units. It provides Ireland with an infrastructure for overcoming factors affecting the diagnosis of neurological disorders in neonates. The system supports collaborative efforts by neurophysiologists, removes geographical constraints on expert knowledge and allows for the creation of national data stores while simultaneously supporting the transAtlantic processing of EEG. Technical obstacles affecting its successful implementation are outlined and solutions proposed. The implementation of such a system could significantly improve the quality of care provided to neonates."
      },
      {
        "authors": "Ruairi O'Reilly, PD Healy, GB Boylan and JP Morrison",
        "title": "Interactive Annotations to Support Collaborative Analysis of Streaming Physiological Data",
        "venue": "The 24th International Symposium on Computer-Based Medical Systems",
        "year": "2011",
        "pdf": "https://drive.google.com/file/d/17D00gwflQtC10MjXU-iDV8UlWLHuBFlM/view?usp=sharing",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/221030561_Interactive_annotations_to_support_collaborative_analysis_of_streaming_physiological_data",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1ePZ2MQGIy_fP2_NXfKnK36HGZX5ga-rH/view?usp=sharing",
        "abstract": "The processing of a patient in a medical facility encompasses data acquisition, data analysis, diagnosis and medical reporting. The result is a program of treatment for the patient. It is postulated that the latter two stages can be facilitated by allowing acquisition locations to avail of data interpretation by multiple off-site analysts who interactively annotate patient data in a collaborative fashion. The concept of “meta annotations” is also introduced, whereby users can comment on an annotation or supply a confidence rating that indicates their assessment of the accuracy of an annotation. This concept enhances the utility of annotations by transforming them from simple textual labels to focal points for discussion and consensus building."
      },
      {
        "authors": "Ruairi O'Reilly, PD Healy, JP Morrison and GB Boylan",
        "title": "An Agent Framework for the Analysis of Streaming Physiological Data",
        "venue": "The 3rd International ICST Conference on Electronic Healthcare",
        "year": "2010",
        "pdf": "https://drive.google.com/file/d/1EIsgWvh9XySkSQ2fMIopQAGL2b_z4AFq/view?usp=sharing",
        "type":"workshop",
        "research_gate": "https://www.researchgate.net/publication/220896593_An_Agent_Framework_for_the_Analysis_of_Streaming_Physiological_Data",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1lSr1nrQ0n1es69_h9mh1m-S8iW3_-i0e/view?usp=sharing",
        "abstract": "An agent framework that assists with the interpretation of streaming physiological data is presented. The framework operates as a module within an existing remote monitoring system for streaming physiological data. Agents complement the remote monitoring system by enhancing the users' view of the signals through the addition of annotations and the creation of derived views of the signals."
      },
      {
        "authors": "PD Healy, Ruairi O'Reilly, GB Boylan, and JP Morrison",
        "title": "Web-based remote monitoring of live EEG",
        "venue": "The 12th International Conference on E-Health Networking, Applications and Services",
        "year": "2010",
        "pdf": "https://drive.google.com/file/d/1jJ-yDew55UxIucxB6ZMchI22_DKmsBTc/view?usp=sharing",
        "type":"conference",
        "research_gate": "https://www.researchgate.net/publication/224169679_Web-based_remote_monitoring_of_live_EEG",
        "google_scholar": "",
        "bib": "https://drive.google.com/file/d/1KCFWALZkjAUaGGjS5BFsyn8Yjdr0YEFr/view?usp=sharing",
        "abstract": "In a critical care setting, delays in the diagnosis of neurological conditions can have a significant impact on patient outcomes. Recording the electrical activity of the brain (EEG) is often used to diagnose and monitor neurological conditions. A trained neurophysiologist is then required to analyse these signals. However, in many cases this expertise is not available on-site. A web-based remote monitoring system for EEG data is presented that reduces the delays that can arise when off-site expert analysis is required. The system allows EEG data to be streamed to a remote location in near-real-time and viewed while acquisition is ongoing. Data streamed earlier may also be reviewed, providing the user with a continually updating view of the entire EEG recording. All communications are performed using web technologies in order to minimise issues with firewalls and to enable analysis on most web-connected PCs. The only tool required for viewing EEG data is a modern web browser with the commonly-available Adobe Flash plugin installed. Since these are ubiquitous, data analysis is not limited by geographic location. Moreover, multiple users can independently view the data simultaneously."
      }
    ]
}